Functions
Add-On Identification
Functions related to the unique identification of the Add-On. More...
 Functions
API_Token  | ACAPI_GetToken ()
Returns the token associated with the AddOn.
GSErrCode __ACENV_CALL  | ACAPI_AddOnIdentification_Application (API_ServerApplicationInfo *serverApplicationInfo)
Returns information about the current application.
GSErrCode __ACENV_CALL  | ACAPI_GetOwnLocation (IO::Location *ownFileLoc)
Returns the location of the add-on in the file system.
Detailed Description
Functions related to the unique identification of the Add-On.
Function Documentation
◆ ACAPI_AddOnIdentification_Application()
 GSErrCode __ACENV_CALL ACAPI_AddOnIdentification_Application  |  ( |  API_ServerApplicationInfo *  |  serverApplicationInfo | )
Returns information about the current application.
Parameters
serverApplicationInfo | [out] Information about the server application. Contains the main and maintenance release number of the server application.
Returns
NoError - The function has completed with success.
APIERR_BADPARS - the serverInfo is nullptr.
Remarks
This function is used to get that the add-on is currently running in Archicad or the 3D Engine. The returned serverInfo->serverApplication value can be:
APIAppl_ArchiCADID : add-on is currently running in Archicad.
◆ ACAPI_GetOwnLocation()
 GSErrCode __ACENV_CALL ACAPI_GetOwnLocation  |  ( |  IO::Location *  |  ownFileLoc | )
Returns the location of the add-on in the file system.
Parameters
ownFileLoc | [out] On return contains the location of the add-on in the file system.
Returns
NoError - The function has completed with success.
APIERR_NOTINIT - The internal variable holding the location of the add-on hasn't been initalized yet.
◆ ACAPI_GetToken()
 API_Token __ACENV_CALL ACAPI_GetToken  |  ( |   | )
Returns the token associated with the AddOn.
Returns
The token associated with the add-on.
Remarks
It is not guaranteed that this function will always return the same value. Always obtain your token by calling this function on demand.
Since
Archicad 25
Returns
The token associated with the add-on.
Remarks
It is not guaranteed that this function will always return the same value. Always obtain your token by calling this function on demand.